{"data":[{"title":"St. Olaf Public Safety","phoneNumber":"5077863666","buttonText":"Call Public Safety","category":"Safety","image":"pubsafe","synopsis":"24-Hour Public Safety Dispatch. Public Safety is available 24 hours a day, most days of the year. Call Public Safety in many situations, but there is always the option of calling the police as well.","text":"**24-Hour Public Safety Dispatch.** [Public Safety][pubsafe] is available 24 hours a day, most days of the year. Call Public Safety in many situations, but there is always the option of calling the police as well.\n\n[pubsafe]: https://wp.stolaf.edu/publicsafety/ \"PubSafe\"\n"},{"title":"Safe Guard","phoneNumber":"5077863666","buttonText":"Call Public Safety","category":"Safety","image":"safe-ride","synopsis":"Students concerned about their personal safety may contact Public Safety to request a walking escort or vehicular transportation on campus and to areas immediately adjacent to the campus.","text":"Students concerned about their personal safety may contact Public Safety to request a walking escort or vehicular transportation on campus and to areas immediately adjacent to the campus.\n\nThis service was created for personal safety reasons only and will not transport groups of people or provide transportation to downtown locations.\n\n*Safe Ride* is available from 7:00 PM to 1:00 AM.\n\n*Safe Walk* is available from 7:00 PM to 1:00 AM, on Friday and Saturday.\n"},{"title":"Title IX Office","phoneNumber":"5077863465","buttonText":"Call College Administration","category":"Safety","synopsis":"Any member of the college community who feels they have experienced sexual misconduct has the option of reporting to the college. Reporting enables the college to take measures to stop the behavior, prevent it from occurring in the future, and provide support, resources, and protection. You can report to the college without initiating a formal investigation or reporting to law enforcement. To make a report, contact the Title IX Case Manager or use St. Olaf’s online reporting form, which can be filled out anonymously.","text":"Any member of the college community who feels they have experienced sexual misconduct has the option of reporting to the college. Reporting enables the college to take measures to stop the behavior, prevent it from occurring in the future, and provide support, resources, and protection. You can report to the college without initiating a formal investigation or reporting to law enforcement.\n\nTo make a report, contact the Title IX Case Manager or use St. Olaf’s [online reporting form][report], which can be filled out anonymously.\n\n[report]: https://wp.stolaf.edu/title-ix/report-sexual-violence \"Sexual Misconduct Online Reporting Form\"\n"},{"title":"HOPE Center","phoneNumber":"8006072330","buttonText":"Call 24-Hour Hotline","category":"Safety","synopsis":"The HOPE Center, located in Faribault, MN, provides free, confidential advocacy services to victims of sexual and domestic violence. Advocates at the HOPE Center provide crisis intervention, support counseling, information, help with protection planning, and referrals. The HOPE Center also provides legal advocacy regarding court procedures, victim rights, and accompaniment to civil and criminal court proceedings.","text":"The [HOPE Center][hope], located in Faribault, MN, provides free, confidential advocacy services to victims of sexual and domestic violence. Advocates at the HOPE Center provide crisis intervention, support counseling, information, help with protection planning, and referrals.\n\nThe HOPE Center also provides legal advocacy regarding court procedures, victim rights, and accompaniment to civil and criminal court proceedings.\n\n[hope]: http://hopecentermn.org \"HOPE Center\"\n"},{"title":"SARN","phoneNumber":"5074030076","buttonText":"Call SARN","category":"Wellness","image":"sarn","synopsis":"SARN, the Sexual Assault Resource Network, is a confidential resource available to all students. Calls to SARN will be picked up by a trained advocate to provide services to students struggling with issues of sexual and domestic violence. Students can also visit the SARN office in Buntrock Commons room 113.","text":"SARN, the [Sexual Assault Resource Network][sarn], is a confidential resource available to all students. Calls to SARN will be picked up by a trained advocate to provide services to students struggling with issues of sexual and domestic violence.\n\nStudents can also visit the SARN office in Buntrock Commons room 113.\n\n[sarn]: https://pages.stolaf.edu/sarn/ \"SARN\"\n"},{"title":"Boe House","phoneNumber":"5077863062","buttonText":"Contact Boe House","category":"Wellness","image":"boe-house","synopsis":"The Counseling Center was established by St. Olaf College to enhance the personal growth and development of its students. The Center supports students in their academic pursuits and facilitates personal and interpersonal learning and growth. The center provides preventive as well as remedial programs. When contacting us to make an appointment, please note that we are often busy which may cause a delay in how quickly we can schedule you in. However, if you are in need of an appointment, please call and we will accommodate you as best we can.","text":"The [Counseling Center][boehouse] was established by St. Olaf College to enhance the personal growth and development of its students. The Center supports students in their academic pursuits and facilitates personal and interpersonal learning and growth.\n\nThe center provides preventive as well as remedial programs. When contacting us to make an appointment, please note that we are often busy which may cause a delay in how quickly we can schedule you in. However, if you are in need of an appointment, please call and we will accommodate you as best we can.\n\n[boehouse]: https://wp.stolaf.edu/counseling-center/ \"Boe House Counseling Center\"\n"},{"title":"College Pastors","phoneNumber":"5077863092","buttonText":"Call Pastors' Office","category":"Wellness","synopsis":"College Pastors are confidential resources trained in pastoral care. They are able to speak with students of any faith, or who don’t practice a religious faith, about all aspects of life.","text":"[College Pastors][pastors] are confidential resources trained in pastoral care. They are able to speak with students of any faith, or who don’t practice a religious faith, about all aspects of life.\n\n[pastors]: https://wp.stolaf.edu/ministry/staff/ \"College Ministry Staff\"\n"},{"title":"The Pause Kitchen","phoneNumber":"5077866969","buttonText":"Call The Pause","category":"Food","image":"pause-kitchen","synopsis":"Place orders in The Pause Kitchen. The Pause delivers anywhere on campus, or orders can be placed for pickup. The Pause does not deliver to honor houses. For orders of 4 or more pizzas, please [order on Oleville][online-order] at least 24 hours in advance. Pizza Delivery Hours are Sunday – Thursday from 6:00PM – 11:30PM, and Friday – Saturday from 8:00PM – 1:30AM.","text":"Place orders in The Pause Kitchen. The Pause delivers anywhere on campus, or orders can be placed for pickup. The Pause does not deliver to honor houses.\n\nFor orders of 4 or more pizzas, please [order on Oleville][online-order] at least 24 hours in advance.\n\n## Pizza Delivery Hours\n**Sunday – Thursday:** 6:00PM – 11:30PM\n**Friday – Saturday:** 8:00PM – 1:30AM\n\n[online-order]: http://oleville.com/pause/large-order-form/ \"Order on Oleville\"\n"},{"title":"Health Services","phoneNumber":"5077863063","buttonText":"Call Health Services","category":"Health","synopsis":"The St. Olaf Health Service provides free, confidential, on-campus healthcare visits for students. Medications and testing are available to students during their clinic visit, when appropriate, for a minimal out-of-pocket fee. Appointments can be made to discuss education and questions regarding birth control and Plan B as well as Sexual Transmitted Infection education and testing, and pregnancy testing.","text":"The [St. Olaf Health Service][hs] provides free, confidential, on-campus healthcare visits for students. Medications and testing are available to students during their clinic visit, when appropriate, for a minimal out-of-pocket fee.\n\nAppointments can be made to discuss education and questions regarding birth control and Plan B as well as Sexual Transmitted Infection education and testing, and pregnancy testing.\n\n[hs]: https://wp.stolaf.edu/health/ \"Health Service\"\n"}]}
