{"data":[{"word":"AAC","definition":"The Academic Advising Center provides support in exploring academic goals within the context of possible career and life-long goals. The Center supports both faculty advisors and their advisees in providing the necessary information and skills to fulfill graduation, general education and major requirements.\n\nThe Center also assists students in exploring possible major options, in changing faculty advisors, in using a degree audit, class/lab schedule, and the St. Olaf Catalog for necessary information about fulfilling requirements.\n\nAcademic Peer Advisors assist the Center.\n"},{"word":"ACE","definition":"Academic Civic Engagement is an approach to teaching and learning that encourages students to learn in community contexts. Students consider community-based experiences in relation to classroom learning and apply academic knowledge and skills to strengthen communities as an integrated component of an academic course.\n"},{"word":"ACM","definition":"The Association for Computing Machinery is an international organization supporting the field of Computer Science. The recently accredited student chapter at St. Olaf aims to foster the computing community on campus through social events, workshops, talks, contests, demonstrations, tutoring, and community service.\n\nThe activities and overall direction of the ACM are largely determined by the student members.\n"},{"word":"ADC","definition":"ADC stands for the After Dark Committee. As part of the Student Government Association, ADC is responsible for planning events for the student body. As the name describes, the committee handles events after dark. They plan events in the 10pm-2am time slot. Events have included paint parties in the Pause, Laser Tag, dances, and much more!\n"},{"word":"Admissions","definition":"This is where the St. Olaf journey begins. The Admissions Office guides future Ole prospects to see all the good in St. Olaf.\n"},{"word":"Agnes A Cappella","definition":"The female student a cappella group on campus. This is a very competitive group to become a part of because they are so highly liked by all of campus. The group holds concerts open to the public throughout the year. The campus favorite is the Holiday Concert where Agnes and the Limestones perform together.\n"},{"word":"Alias","definition":"The term for a group of email addresses made for an easier way to mass email. Professors use aliases for easy communication with their classes and students use aliases for easy communications with student organizations they participate in.\n"},{"word":"AmCon","definition":"Short for American Conversations, an interdisciplinary General Education program and learning community in which students analyze America’s history and culture.\n\nOver four successive semesters in their first and sophomore years, AmCon students encounter many of the texts, topics, and historical developments that have defined “America” from its earliest colonization to the present.\n\nAmCon students make up a true academic community, living in a common dorm in their first year and complementing their in-class education with dinners, informal gatherings and field trips. Through the inclusion of an academic civic engagement component, moreover, students develop as active citizens, bringing their ideas and energy into the larger community.\n"},{"word":"ARMS","definition":"“American Racial and Multicultural Studies” is a program committed to the study of racial and cultural diversity within the United States. The major introduces students to the cultures, histories, and experiences of African Americans, Native Americans, Latinos, Asian Americans, and people of Middle Eastern descent.\n"},{"word":"AsianCon","definition":"Asian Conversations offers you a dynamic cultural exploration that begins with two semesters of Chinese or Japanese language study during your first year on campus.\n\nDuring sophomore year you continue your language study while taking three linked courses organized around the theme of “Journeys Through Asia.” Readings include historic and contemporary narratives from Asian travelers, pilgrims, migrants, great writers, and political leaders.\n\nYou explore connections across Asia from diverse perspectives in the humanities and social sciences, complemented with language skills in Chinese or Japanese.\n"},{"word":"BASICS","definition":"BASICS is a “drinker’s checkup” that helps you examine your use, identify changes that could work for you and reduce your risk of future problems. It’s not therapy or substance abuse treatment. Any student who’s concerned about their alcohol or other drug use can choose to attend BASICS.\n\nStudents who violate St. Olaf’s alcohol and drug policies, are medically transported for alcohol or drug intoxication, held in protective custody, or are court-sanctioned may be mandated to attend BASICS.\n"},{"word":"Big Ole","definition":"In 2005 we became the first liberal arts college in the nation to construct a utility-grade wind turbine for the sole purpose of providing energy to the campus (Carleton College was the first to construct a turbine, but the electricity it produces is sold to an energy company and added to the general power grid).\n\nOur 1.65 megawatt self-generating wind turbine directly supplies up to one- third of the electricity used by the college.\n"},{"word":"Black and Gold Gala","definition":"The Alumni Board hosts this annual opportunity for alumni, parents, and friends of St. Olaf College to enjoy an evening of dinner and dancing while supporting current students. The event also features a silent auction in which all proceeds go directly into the St. Olaf Fund.\n"},{"word":"Board of Regents","definition":"The St. Olaf Board of Regents manages and directs the business and affairs of the college. Among its many responsibilities, the board ultimately oversees the academic integrity of the college by appointing the president, awarding tenure to the faculty upon the president’s nomination, and adopting policies that establish the rights and obligations of faculty members.\n"},{"word":"Boe Chapel","definition":"Dedicated in 1954, Boe is meant to be a place for worship, music, edifying convocations, college ceremonies, the arts and private meditation. Daily Chapel takes place here during a break from classes.\n"},{"word":"Boe House","definition":"Boe House houses the Counseling Center, which was established by St. Olaf College to enhance the personal growth and development of its students. The Center supports students in their academic pursuits and facilitates personal and interpersonal learning and growth.\n\nThe Counseling Center is open during the academic year from 8:00 a.m. to 12:00 noon and from 1:00 p.m. to 5:00 p.m., Monday through Friday.\n"},{"word":"Book","definition":"The official student planner of St. Olaf College. The Book contains college policies, schedules, and information related to student life, academic and non-academic, at St. Olaf in addition to being a full year, calendar planner. SGA produces The Book each year.\n"},{"word":"Bookstore","definition":"Home to all textbooks, Ole gear, school supplies, and more, the Bookstore is conveniently located on the first floor of Buntrock Commons.\n"},{"word":"BORSC","definition":"As a branch of the Student Government Association, the Board of Regents Student Committee facilitates communication between the student body and the Board of Regents of the college. A primary responsibility of BORSC is to represent student concerns regarding the long range planning of the college, especially those aspects directly managed by the Board of Regents.\n"},{"word":"Buntrock Commons","definition":"The student center of St. Olaf College. Opened in 1999, it is the central gathering place for students. Students get their mail, eat, buy books, meet, get involved, host events, and just hang-out here. Check out the “Hi-Mom Cam” in the Crossroads to see the daily stream of activity.\n"},{"word":"CAAS","definition":"The Center for Advising and Academic Support (CAAS) provides resources for all St. Olaf students as they work to maximize their full academic potential. CAAS collaborates with faculty, staff, and other campus partners to provide a range of services, programs, and resources to support student learning. Support is student-centered, accessible, inclusive and free of charge.\n\nAdvising supports both college advisors and their advisees in providing the necessary information and skills to fulfill graduation, general education, and major requirements. We also assist students in exploring possible major options, in changing faculty advisors, in using a degree audit, class/lab schedule, and the St. Olaf Catalog for necessary information about fulfilling requirements.\n\nAcademic Support includes a variety of offerings to all St. Olaf students as they work to maximize their full potential. We teach tools, strategies, and provide opportunities to develop students’ learning skills.\n\nOles can take advantage of peer tutoring, group study, workshops, and one-on-one coaching. We look forward to meeting with you to discuss your individual learning goals\n\nCall [ext. 3288](tel://5077863288) with questions.\n"},{"word":"Caf Date","definition":"One of the most common “dates” on campus. Couples can cozy up in the window booths or sit in the middle of the Caf for everyone to see!\n"},{"word":"Caf","definition":"The shortened version of “Cafeteria,” Stav Hall is located on the third floor of Buntrock Commons. Students get to dine with the best food in the nation.\n"},{"word":"Cage","definition":"In the center of Buntrock Commons, the campus coffee shop and grill offers all-day breakfast, hot and cold sandwiches and plate-sized cookies in a lively setting. It’s the perfect place to meet friends or a study group!\n"},{"word":"Career Networks for Oles","definition":"Designed by the Piper Center for Vocation and Career in conjunction with President David R. Anderson ’74 and the Office of Alumni and Parent Relations. The program connects St. Olaf juniors and seniors with the College’s alumni and parent community in meaningful and substantive ways in order to give students a chance to learn about careers, internships and jobs in their fields of interest while providing alumni and parents the opportunity to share their professional experiences and expertise.\n"},{"word":"Center for Arts and Dance","definition":"Before Buntrock Commons was built, the Center for Arts and Dance housed the student center. By adding more natural lighting with strategic window placement, the Center is now home to the Studio Art, Art History and Dance departments. The building also houses the Flaten Art Museum.\n"},{"word":"Christiansen Hall of Music","definition":"Christiansen (pronounced kris-tee-AHN-sen) Hall of Music is home to the Music Department and the Music Organizations staff that supports concerts and tours by the ensembles. Named after St. Olaf Choir founder F. Melius Christiansen, the building houses Urness Recital Hall, the Margaret Skoglund Reception Room, the Halvorson Music Library, three rehearsal rooms, classrooms, practice rooms, faculty studios, and the electronic music studio.\n"},{"word":"Christmas Festival","definition":"As one of the oldest musical celebrations of Christmas in the United States, Christmas Fest was started in 1912 by F. Melius Christiansen, founder of the St. Olaf College Music Department. The festival features more than 500 student musicians who are members of five choirs (St. Olaf Choir, Viking Chorus, Chapel Choir, Cantorei, and Manitou Singers) and the St. Olaf Orchestra. The festival, which is regularly broadcast nationwide on public television and radio, has been featured in hundreds of publications, including TV Guide, Wall Street Journal, and the Los Angeles Times.\n"},{"word":"Club Sports","definition":"An opportunity for athletes to participate in a variety of sports and recreational activities that are not a part of the program of NCAA intercollegiate sports administered by the St. Olaf Athletics Department. Club sports include: Cycling, Men’s Hockey, Men’s Lacrosse, Men’s Rugby, Men’s Volleyball, Men’s Ultimate, Rowing, Women’s Lacrosse, Women’s Rugby, and Women’s Ultimate.\n"},{"word":"Companydance","definition":"A project-based student dance company that offers a range of performing opportunities and is open by audition to all students. The company’s primary aesthetic is grounded in the modern dance tradition, but is by no means restricted to it.\n"},{"word":"Conversation Tables","definition":"As part of the Foreign Language GE, students attend weekly dinner tables to work on their “conversation” skills in the language they are studying.\n"},{"word":"DAC","definition":"The Disability and Access Center is located in the Center for Advising and Academic Support (CAAS) and gives students an opportunity to access academics differently and work with professional staff to establish accommodations with respect to disabilities ranging from physical to learning. Students who have not yet been evaluated for a disability but suspect that there might be a barrier to their academics can also work with a professional staff member.\n"},{"word":"Daily Chapel","definition":"With different speakers every day, daily chapel is a time of inspiration for body, mind and spirit; a quiet harbor in a busy day; worship. Students, faculty and staff witness to their faith and invite the community to join them. All are welcome!\n"},{"word":"Dean of Students","definition":"The deans coordinate and direct services and programs designed to assist students in taking full advantage of their St. Olaf experience, both in and out of the classroom. The Dean of Students Office Suite is home to the Vice President, Dean of Students, the Associate Deans and Residence Life.\n"},{"word":"Deep End","definition":"The two-pronged theater production and student service organization is dedicated to providing acting, directing, writing, and technical opportunities for students who are not involved in theater department productions.\n"},{"word":"Den","definition":"Home to the Lion’s Pause Pool table and Sports Center vibe, the Den is located in Buntrock Commons in the Pause where students go to relax, eat, and catch the game on TV.\n"},{"word":"Dinner Debate","definition":"The Political Awareness Committee (PAC) plans and hosts dinner debates in which students can bring their caf trays and go, listen, and participate in debates on a variety of issues on campus.\n"},{"word":"DISC","definition":"The Diversity Initiatives Support Committee is a branch of the Student Government Association (SGA). The purpose of this branch is to provide organizations of historically marginalized groups with the support and funding necessary for them to accomplish their mission at St. Olaf.\n"},{"word":"Drag Ball","definition":"For one night every year, the Drag Ball gives students a chance to abandon dress codes, gender roles and inhibitions in celebration of cross-dressing. This popular event is hosted in the Pause Mane Stage!\n"},{"word":"E-Check Up to Go","definition":"This is an interactive web survey that allows college and university students to enter information about their drinking patterns and receive feedback about their use of alcohol. The confidential assessment takes about 7-8 minutes to complete, is self-guided, and requires no face-to-face contact time with a counselor.\n"},{"word":"E-Toke","definition":"This is an interactive web survey that allows college and university students to enter information about their marijuana habits and receive feedback about their use of marijuana. The confidential assessment takes about 7-8 minutes to complete, is self-guided, and requires no face-to-face contact time with a counselor or administrator.\n"},{"word":"Early Music Singers","definition":"Consists of 14-20 singers and focuses primarily on music of the Medieval, Renaissance, and Baroque eras. The choir performs a concert each semester in collaboration with the St. Olaf Collegium Musicum, St. Olaf’s early instrument ensemble.\n"},{"word":"Elections","definition":"Every fall and spring, the Student Government Association hold elections for positions within SGA and Student Senate. Check out Oleville for more info!\n"},{"word":"Ellingson","definition":"As a four-story first-year residence hall, Ellingson houses 198 students. Spacious lounges enable students to study and relax at ease.\n"},{"word":"EnCon","definition":"In a world needing to tackle climate change and other ecological crises, environmental concerns have become relevant for everyone. As such, St. Olaf is proud to offer the Environmental Conversations (EnCon) program. It is open to any admitted student wanting to start college in a learning community inquiring after a life of environmental thoughtfulness.\n"},{"word":"Fall Concert","definition":"Each fall, the Music Entertainment Committee (MEC) hosts an up and coming talent concert. Recent fall concerts have been Girl Talk, OK Go, The Hold Steady, and Brother Ali.\n"},{"word":"FCO","definition":"Fellowship of Christian Oles (FCO) is a group of people who gather once a week to discuss ideas, worship together, and share in the joy of Christ- centered relationships. We are a community striving to live as Christ calls us to live, with a heart for outreach in our own St. Olaf community and beyond. Through small groups, weekly meetings, and service trips we build relationships, welcoming people in all walks of Christian faith.\n"},{"word":"Fireside","definition":"Located on the second floor of Buntrock Commons, it is a place to lounge, study, and enjoy yourself. During the winter months, fires can be made in the fireplace!\n"},{"word":"Fram! Fram!","definition":"King Olav’s (Olaf’s) battle cry, “Fram, Fram, Kristmenn, Krossmen” can be found on the St. Olaf College crest.\n"},{"word":"Fresh Faces","definition":"A Deep End production for first-years. Fresh Faces is an opportunity to be in all first-years cabaret featuring acting scenes, dance numbers, musical pieces from popular theater.\n"},{"word":"Friday Flowers","definition":"One of the most popular traditions for students! Each Friday, a local florist sells single flowers for students to buy and put in each other’s p.o. boxes. The p.o. boxes are wonderful to walk by to see all the flowers sticking out!\n"},{"word":"Global Semester","definition":"One of the most popular and well known study abroad programs. The Global Semester is a five-month academic program offering five courses in different parts of the world under the supervision of St. Olaf faculty. In cooperation with academic institutions in four countries, courses are designed to enable students to develop windows on the world from distinct academic perspectives through class lectures, field trips, and other activities. The program aims to facilitate immersion in the daily life of each community and develop comparisons with American society. The itinerary takes the group around the world with visits to Switzerland (the United Nations Headquarters in Geneva), Egypt, India, Thailand, Hong Kong, China and South Korea.\n"},{"word":"GLOW!","definition":"Gay, Lesbian, or Whatever! is a student organization comprised of gay, lesbian, bisexual, transgender, and heterosexual persons. GLOW! helps to educate, provide resources for and foster acceptance and support for self- identified GLBT persons with and through the alliance of all sexual orientations and gender identities.\n"},{"word":"Gospel Choir","definition":"A choir open to any student who wants to join! Rehearsals are held once a week.\n"},{"word":"Graduatibility","definition":"The ability for one to be able to graduate.\n"},{"word":"Great Con","definition":"An integrated sequence of five courses taken over two years, the Great Conversation (Great Con) introduces students to the major epochs of Western tradition through direct encounter with significant works. Beginning with the ancient Greeks and Hebrews, the program traces the development of literary and artistic expression, philosophic thought, religious belief, and historical reflections on western culture into the modern world. Students respond to great works, challenging the ideas expressed in them and challenging their own ideas as well, thus joining the conversation of men and women through the ages about the perennial issues of human life.\n"},{"word":"Health Services","definition":"Located on the first floor of Tomson Hall, it is staffed by a certified family nurse practitioner and support staff who collaborate as needed with physicians at the Northfield Hospital Emergency Department. During the school year the office is open to students Monday-Friday, 9:00 – 11:30 a.m. and 1:00–4:00 p.m.\n"},{"word":"Her Campus","definition":"A branch of HerCampus.com, this student organization is a weekly online magazine for the women of St. Olaf. The organization covers all topics from cuties on campus to cooking on campus to the latest and greatest fashion trends.\n"},{"word":"HillKitt","definition":"Because Hilleboe Hall and Kittelsby Hall are connected by the same entrance, the 2 halls have received a joint name as well: Hill/Kitt.\n"},{"word":"Hill","definition":"St. Olaf College sits above the city of Northfield on a hill, so one can often hear the college being referred to as the “Hill.” How are things going on the Hill today?\n"},{"word":"Hilleboe","definition":"Hilleboe houses 123 (upper-class) students while maintaining the largest triple rooms on campus. The Hilleboe Chapel, study lounges, computer facilities, and recreational lounges all provide students with opportunities for studying, learning, and socializing.\n"},{"word":"Holland","definition":"Home to the Economics, History, Philosophy, Political Science, Social Work and Family Studies, and Sociology/Anthropology departments, Holland Hall is a Norman Gothic building that serves as an architectural landmark on campus. The structure and decor of Holland are modeled after Mont-Saint-Michel, a famous monastery in France.\n"},{"word":"Homecoming","definition":"Every fall the Student Activities Committee (SAC) plans and hosts events, games, and activities for students during the week of Homecoming! The Alumni Office plans the festive weekend as the St. Olaf Community gathers for a fun-filled weekend of reconnection, celebration, and activity. Parents of current students and alumni from all classes, come back to the Hill and take part in the many hallmarks of campus life: learning with faculty members, athletic events and music concerts, worship, a campus festival for all ages, and more.\n"},{"word":"Honor House","definition":"The college maintains campus houses that are available for upper-class student housing. These houses provide students with alternative opportunities to explore and develop interests and personal relationships through a more intimate residential setting.\n"},{"word":"Hoyme","definition":"Hoyme (pronounced Hoy·me) Hall is a four-story hall housing 210 first-year students. The main lounge provides a striking view of the surrounding countryside as well as a wonderful space for studying and socializing.\n"},{"word":"Interim","definition":"The Interim is a four-week period of intensive study in one area. Interim provides an opportunity for a professor and his or her students to focus their entire attention on one course for a full month, to offer a time of study in depth. It is a time when unique teaching and learning styles can be utilized in rather traditional courses or when unique subjects can be studied in some international or off-campus domestic location. Interim is a very popular time for study abroad!\n"},{"word":"Intramurals","definition":"For all students who want to participate in some team sport, but maybe want something a little less demanding — Intramurals provide weekly games year round. Grab a team, sign-up, and play!\n"},{"word":"ISO","definition":"The International Student Organization serves to facilitate discussions and exchanges on a series of cultural, political and personal topics by a series of events such as dinners, dances, International Awareness Week and the annual International Night. ISO also serves to strengthen the bonds between students from different backgrounds, while helping international students integrate into the greater student body. All are welcome to help coordinate or participate in ISO events, and membership is open to all St. Olaf students.\n"},{"word":"IT","definition":"For all things technical, The Information and Instructional Technologies offers a campus-wide network of computing facilities that includes Macintosh, PC-compatibles, and UNIX/Linux-based systems. The Helpdesk in Rølvaag Memorial Library is available for students and faculty alike.\n"},{"word":"JC","definition":"A Junior Counselor (JC) is an upper-class student who works in a pair to build community in first-year residence halls. JC’s are responsible for the floor they live on in addition to the overall hall camaraderie.\n"},{"word":"Jungle","definition":"This giant, light-filled room in the Lion’s Pause is the perfect place to eat your delicious Pause pizza with your friends! The 2 TVs and booths are just a bonus.\n"},{"word":"Kierkegaard","definition":"Søren Aabye Kierkegaard (pronounced Kier·ke·gaard) was a 19th-century Danish philosopher. In Rølvaag Memorial Library, The Howard V. and Edna H. Hong Kierkegaard Library began as the private collection of its founders who used it to support their work translating the writings of Søren Kierkegaard from Danish into English. In 1976, the Hongs gave the Library to St. Olaf College with the understanding that it would exist as a study and publication center, a place where students and scholars of varied experience could come and have access to materials in an environment enhancing their intellectual work.\n"},{"word":"Kildahl","definition":"Kildahl (pronounced Kil·dahl) Hall offers a friendly, comfortable atmosphere for 168, first-year students. The main lounge serves as the center of community, offering many activities and late night conversations around the fireplace. Kildahl is equipped with computer facilities and a strong community that is ideal for studying and socializing.\n"},{"word":"Kitchen (Pause)","definition":"The student-run, full kitchen offers tasty eats at ridiculously low prices. Famous pizzas, quesadillas, shakes, and ice cream all made-to-order! The kitchen is open late to serve that “late-night” craving! Hours are Sunday - Thursday: 10:30am - Midnight, and Friday - Saturday: 10:30am - 2am (shortened menu after 9pm on Fridays and Saturdays).\n"},{"word":"Kittelsby","definition":"Kittelsby (pronounced Kittels·bee) Hall houses students 238 (first-year) students in triple rooms and is connected to Hilleboe Hall. The unique connection to Hilleboe Hall is unlike any of the other first-year dorms.\n"},{"word":"KSTO","definition":"KSTO is a student-run radio station that broadcasts over the airwaves on campus at 93.1 FM. Listeners can access KSTO through the online stream and through their iPhone application.\n"},{"word":"Lair","definition":"The small, quaint, transformable room in the Lion’s Pause used for studying during the day and events at night!\n"},{"word":"Larson","definition":"Larson Hall houses 307 upper-class students. The circular arrangement of each floor creates a strong community atmosphere.\n"},{"word":"Late night breakfast","definition":"During finals week, each semester, one night is scheduled for breakfast food in Stav served by faculty and staff. This is a great break from studying and is one of the students favorite traditions!\n"},{"word":"Libraries","definition":"The St. Olaf collection, housed in three separate libraries (Rølvaag Memorial Library, Hustad Science Library, and Halvorson Music Library), includes approximately 420,000 books, 22,000 media items, 5000 periodical titles, and 18,000 scores.\n"},{"word":"Limestones","definition":"The famous, seven-voice male a cappella group founded in 1989. The Limestones have grown over the years, working through an exciting evolution of a cappella singing. They have incorporated a more contemporary pop style of music, and have performed throughout the Midwest for schools, businesses, private functions, and have also performed in such places as The Ordway Center in St. Paul, MN and on Garrison Keillor’s Prairie Home Companion.\n"},{"word":"Mane Stage","definition":"The Mane Stage is the Pause’s nightclub venue, hosting late-night events for the student body. Modeled after the legendary First Avenue in Minneapolis, this space hosts dances, concerts, student performances, and comedians on a continuous basis.\n"},{"word":"Manitou Messenger","definition":"Founded in 1887, the student newspaper has an intimate staff and a large pool of writers that produce a weekly issue of the paper. The different sections cover the many topics of life on campus as well as national and global news.\n"},{"word":"Manitou Singers","definition":"Comprised of select women’s voices from the first year class, Manitou (pronounced Man·it·toe) is one of the most popular music organizations on the St. Olaf College campus. The 100-voice choir sings at the opening worship service of the college as well as at various campus functions throughout the year such as daily chapel and church services, the annual St. Olaf Christmas Festival, Family Weekend Concert and its own Spring concert in April. With a repertoire that ranges from sacred to secular to popular ballads, the Manitou Singers have broad appeal both on and off campus.\n"},{"word":"MEC","definition":"The Music Entertainment Committee, a branch of the Student Government Association (SGA), devotes its time to organizing diverse concerts, music events, and other forms of music entertainment that cater to the varied interests of St. Olaf students. The purpose of these events is to provide students an escape from academic pressure and to give them an opportunity to become involved in campus life. MEC plans and hosts the fall and spring concerts each year where larger name acts perform!\n"},{"word":"Mellby","definition":"Housing 192 upper classmen, Mellby (pronounced Mell·bee) is the oldest residence hall on campus and its historic appeal truly stands out. It features a kitchen, TV lounge, computer facilities and a large, comfortable main lounge and fireplace.\n"},{"word":"Mohn","definition":"One of the two towers on campus, Mohn (pronounced Moan) is a ten-story residence hall housing 307 students. The hall, which traditionally houses first-year and sophomore students by floor, offers a main lounge, a recreational room, and a piano room. The circular arrangement of each corridor creates a strong community atmosphere.\n"},{"word":"Moodle","definition":"An online program that faculty and students use for classes. Professors can upload a syllabus, calendar, notes, readings, assignments, and quizzes for students to access at their convenience.\n"},{"word":"Multicultural Affairs","definition":"Provides services and assistance to Asian American, African American, Hispanic/Latino American, and Native American Students. MCA provides academic, financial, personal, career, social counseling and support as needed while also promoting the intellectual, social and moral development of all students on campus through the advancement and understanding of culture and heritage.\n"},{"word":"Natural Lands","definition":"In addition to a 300-acre campus, the college owns nearly 700 acres of land adjacent to the campus. Most of this land was farmland rented out to local farmers. The college, principally through the members of the Biology and the Environmental Studies Departments, has conducted extensive natural habitat restoration projects over the past 15 years on some of this farmland. Over 40,000 tree seedlings and nursery stock trees have been planted on approximately 90 acres in an effort to re-establish the dominant Big Woods forest type originally found in our area. Over 150 acres of native, tall grass prairie has been reconstructed and 15 wetlands have been restored. A bluebird trail of 64 houses has been established through our woodlands and prairies. In addition to natural habitat restoration, a sustainable agriculture project has also been ongoing for over 10 years.\n"},{"word":"Norseman Band","definition":"One of two symphonic bands at St. Olaf, Norseman (pronounced Norse·man) has developed a reputation in recent years as a dynamic and exciting concert ensemble. The 85-piece ensemble performs regularly on campus, and has toured each spring to regional locations in Minnesota, Iowa, Wisconsin, Illinois and Michigan, as well as to Canada. The membership of the Norseman Band reflects the broad spectrum of academic interests and geographical diversity of the St. Olaf student body.\n"},{"word":"Norwegian Sweaters","definition":"During the weekend of Christmas Festival, the number of Norwegian sweaters on campus is extraordinary. Oles of all ages embrace the Norwegian heritage while keeping warm! Looking for a Norwegian sweater? Find them in the Bookstore!\n"},{"word":"Old Main","definition":"Built in 1877, Old Main was the first — and originally the only — building to occupy Manitou Heights, containing classrooms, a library, housing for students and faculty, and a dining room. Newly renovated, Old Main is a beautiful place for students to study or relax. During the winter the Hill is a popular place for sledding!\n"},{"word":"Ole Ave","definition":"St. Olaf Avenue, commonly referred to as “Ole Ave”, runs from campus all the way to Highway 3 near downtown Northfield.\n"},{"word":"Ole Bikes","definition":"The Ole Bikes Mechanics team maintains bicycles for use by anyone in the St. Olaf community as part of the campus transportation infrastructure. These 30 bikes are available for speeding you to class on time, down to Northfield and Carleton or further out of town for fun and exercise. Check one out at Rølvaag Library!\n"},{"word":"Ole card","definition":"The all-in-one I.D. card for all students. The Ole Card is used to eat meals in the Caf, buy coffee and snacks at the Cage, get a sweet treat at the Pause, purchase school supplies at the Bookstore, print documents for class, AND get students into their halls. The Ole Card carries “Flex dollars” in addition to “Ole dollars.” Flex dollars, provided by your meal plan, allow you to purchase things at the Cage; you can also use them to buy meals at the Caf, beyond what is provided with your meal plan. Ole dollars are the amount of money a student puts on their own Ole Card. They can be used at the Caf, the Cage, or the Pause, and some stores in town will also accept them. Students do not have to deposit money on their cards, but it makes for easy transactions around campus. Carleton's Caf network will also debit meals from your St. Olaf meal plan, so you can visit their campus, eat, and enjoy a change of scenery occasionally.\n"},{"word":"Ole cookie","definition":"Similar to a “monster” cookie, The Cage sells delicious cookies with oats, peanut butter, and candy pieces all combined into one giant St. Olaf cookie!\n"},{"word":"Ole Spring Relief","definition":"The annual, large-scale service trip that takes place over the week of spring break. All students have the opportunity to sign-up and take part in this great trip!\n"},{"word":"Ole the lion","definition":"The beloved mascot of St. Olaf.\n"},{"word":"Oleville","definition":"The official website of the Student Government Association (SGA). Oleville explains the various branches of SGA.\n"},{"word":"Orgs","definition":"Student Organizations are known around campus just as “orgs.” To become an organization, a club must apply to the Student Organizations Committee (SOC). Then, SOC is able to provide funding for the organization.\n"},{"word":"PAC","definition":"The Political Awareness Committee is a branch of the Student Government Association (SGA) and is the primary student promoter of political awareness and activity on the St. Olaf campus. Committed to nonpartisan political education and activism, PAC seeks to serve all members of the St. Olaf student body as a political resource, ultimately making students into responsible and knowledgeable citizens. PAC brings in big-name speakers for very large events twice a year, known as the fall and spring speaker.\n"},{"word":"PaCon","definition":"The Public Affairs Conversation (PaCon) engages students and faculty in a search to develop an interdisciplinary perspective on American public policy. This yearlong program for juniors and seniors consists of two courses (fall and spring) and an internship (in interim, spring, or summer). The courses focus on contested ideals and contemporary controversies in American public affairs. The first course looks at the evolution of contested ideals in American politics as they develop in the founding period and throughout the history of the republic. The course also engages a range of contemporary normative perspectives that are the foundation of the contemporary debate. The second course blends normative and empirical analysis of contemporary public policy. Both courses will be supplemented by co-curricular activities and events.\n"},{"word":"Pause","definition":"The Lion’s Pause, a branch of the Student Government Association (SGA),is most commonly shortened to just the Pause. This is a student-run nightclub located on the first floor of Buntrock Commons. Students are lucky to have a facility like this at their disposal — very few other schools in the nation have such a nice space! The Pause consists of 5 rooms: The Den, Lair, Jungle, Kitchen, and Mane Stage. The Kitchen is a student-staffed kitchen serving pizza, shakes, and more.\n"},{"word":"PDA","definition":"President David R. Anderson’s (’74) nickname around campus.\n"},{"word":"Pep band","definition":"Provides musical entertainment and lead fan enthusiasm at St. Olaf football and basketball games. The students involved are dedicated to enhancing team support and the spirit of the crowds at games.\n"},{"word":"Piper Center","definition":"Located in Tomson Hall, The Piper Center for Vocation and Career provides resources and experiences designed to help students leverage their liberal arts education to achieve their full potential. The Piper Center innovatively strives to equip St. Olaf students with resources for achieving immediate and life-long career success.\n"},{"word":"PO Box","definition":"All students get a mailbox that is referred to as their “P.O.” Mailboxes are not locked because campus is known for being very safe, as all students are respectful of each other.\n"},{"word":"President's Ball","definition":"The President's Ball, otherwise known as Prez Ball, is an annual event planned by the Student Activities Committee and enjoyed by students, faculty, and staff alike. It is a chance to socialize with the President and his wife, enjoy hors’devours, and dance the night away. Live music all night, and dance lessons from the Ballroom Club make this a must-attend event!\n"},{"word":"Pub Safe","definition":"Provides 24-hour security services, patrol and response throughout the year. Public Safety is dedicated to the safety and protection of the entire St. Olaf community. Officers are charged with enforcing college policies as well as local and state laws where applicable, that occur on college property.\n"},{"word":"Quad","definition":"Behind Buntrock Commons and within the space between Rølvaag, Holland, Regents, Tomson, Mellby, the Theater, and Boe, is the area known as the Quad. On beautiful, sunny days, students gather to talk, eat, play frisbee, or just enjoy the Olaf community feel!\n"},{"word":"Quarry","definition":"The student-edited fine arts journal that publishes the best of St. Olaf students’ literary works and visual art. Fiction, creative non-fiction, and poetry are all featured alongside photography, paintings, and other forms of visual creative expression.\n"},{"word":"Quidditch","definition":"Since St. Olaf so closely resembles Hogwarts, it is only fair that we have a Quidditch club! The St. Olaf Quidditch Association brings the wonders of Quidditch to the St. Olaf campus on a weekly basis. With pick up games every week and the coveted House Cup, Quidditch provides the opportunity that everyone has always wanted.\n"},{"word":"R25","definition":"The “room scheduling” program for all of campus, excluding the Lion’s Pause. This is an easy way to reserve rooms/places on campus from the convenience of your own computer.\n"},{"word":"RA","definition":"A Resident Assistant (RA) is an upper class student who builds community in upper-class residence halls.\n"},{"word":"RACE","definition":"Race and Ethnic Studies is an interdisciplinary program committed to the study of people of color, primarily, though not exclusively, in the United States. The major acquaints students with the social, cultural, and historical contributions and lived experiences of African Americans, Native Americans, Asian Americans, Latinos/as, and Middle Eastern Americans as well as the cultures and nations outside of the United States from which such peoples are drawn. The program also offers a concentration.\n"},{"word":"Rand","definition":"Nestled into the north face of Manitou Heights, Rand Hall houses 243 upper- classmen. A variety of living options are available in Rand including single, double, and quad occupancy rooms. Its suites share their own bathrooms. The hillside location offers a beautiful view of the woods and fields surrounding the college.\n"},{"word":"Reading Day","definition":"Before finals start, this day is dedicated to studying. This “free” day between when classes and and finals begin is a time for students to recover, plan, and study.\n"},{"word":"Regents","definition":"Firmly rooted in a vision that articulates an integrated approach to the study of natural sciences and mathematics, Regents Hall is carrying the sciences at St. Olaf deep into the 21st century, housed in inspiring and innovative learning spaces explicitly designed to promote the student- faculty interactions for which St. Olaf is known.\n"},{"word":"Residence Life","definition":"St. Olaf’s beautiful residential campus is a center for academic, social, cultural, and recreational activities. The Residence Life Office strives to engage, motivate, and challenge students in 11 residence halls and 21 honor houses across campus serving 96% of the student body. We are committed to providing a safe, comfortable, and student centered living environment that promotes personal and academic success.\n"},{"word":"RMS","definition":"The Regents Hall of Mathematical Sciences (RMS) is the 6 floor building connected by tunnel between Tomson Hall and the rest of Regents. It is home to the offices for the mathematics, statistics, and computer science professors.\n"},{"word":"Rølvaag","definition":"Named for the Norwegian immigrant, Ole E. Rølvaag (pronounced Røl·vaag) (1876-1931), novelist, educator, and St. Olaf graduate, Rølvaag Memorial Library was completed in 1942 and is the main library on campus. The many group study rooms, computer labs, and quiet nooks provide students with any area to call their own.\n"},{"word":"Room Draw","definition":"Process in which students sign up for housing for the next year. Towards the end of the school year, students receive a room draw “number” in their P.O. and that number will determine the order in which they are eligible to choose where they want to live the following year.\n"},{"word":"SAC","definition":"The Student Activities Committee branch of SGA organizes diverse events and activities that cater to the varied interests of students. SAC provides students with unique escapes from their academic responsibilities. SAC upholds St. Olaf traditions such as Homecoming Week and the President’s Ball. SAC also has weekly movies and provides special events throughout the year that include comedians, magicians, novelty acts and even speed dating!\n"},{"word":"SARN","definition":"The Sexual Assault Resource Network takes a stand against sexual assault and intimate violence on campus through supporting survivors and raising awareness in the college community. SARN is a CONFIDENTIAL source on campus with the principle concern of making sure that survivors of sexual, domestic and emotional abuse find their needs and concerns met with compassion and competence. SARN services include: victims’ rights and legal advocacy, crisis intervention, referrals, assistance with administrative hearing processes, education and information on sexual assault, domestic violence, child abuse, and healthy relationships or just someone to talk to. Advocates are on call nightly from 8:00pm - 8:00am during the academic year at x3777.\n"},{"word":"SAS","definition":"The Student Accessibility Services is located in the Center for Advising and Academic Support (CAAS) and gives students an opportunity to access academics differently and work with professional staff to establish accommodations with respect to disabilities ranging from physical to learning. Students who have not yet been evaluated for a disability but suspect that there might be a barrier to their academics can also work with a professional staff member.\n"},{"word":"Scared Scriptless","definition":"The student improv group at St. Olaf. Their mission is to entertain the community through improvisational theater. In addition, Scared Scriptless gives students the opportunity to perform improv theater regardless of their amount of previous experience.\n"},{"word":"SciCon","definition":"The Science Conversation (SciCon) is a sequence of three linked courses (fall, interim, spring) for sophomore students. The program brings together students and faculty with a broad range of academic interests for a critical exploration of science within its historical, cultural, and social contexts. SciCon encourages a philosophically and theologically informed appreciation for the development of science, the relationship between reason and faith, questions of meaning and purpose, and the complex interplay of science and society. It is designed to illuminate the distinctive character of science and its relevance to the challenges facing our world.\n"},{"word":"Senate","definition":"The Student Senate provides a venue where elected representatives — Hall Senators, special constituency Senators (like Multicultural and Off-Campus), faculty committee student participants, and the members of the SGA Executive team — discuss the operations of the Student Government. Administrators and staff present information regarding the College and frequently solicit student feedback from Senators. All Senate meetings are open to any student who wants to come and listen!\n"},{"word":"SGA","definition":"The Student Government Association (SGA) is lead by students who want to make life on campus an adventure for their fellow peers. The ten branches of SGA bring concerts, political speakers, diversity celebrations, late-night activities, Homecoming, pizza bagels in the Pause, student representation to the Board of regents, volunteer opportunities, connections with alumni, funding for student organizations, and so much more!\n"},{"word":"SIS","definition":"The Student Information System (pronounced S.I.S.) is an all-in-one place for students to register for classes, look at their degree audit and look over their financial statements. You can use SIS on your desktop or in this application.\n"},{"word":"Skoglund","definition":"Skoglund hosts varsity basketball and volleyball games in its 2,008-seat arena, and its natatorium is home to the men’s and women’s swimming and diving teams. Skoglund also has a field house, racquetball courts, wrestling room, sauna, locker rooms, an athletic training room, and the athletic department offices. Outdoor tennis courts are located behind the building, near the softball, baseball and soccer fields. In addition to housing athletics, Skoglund Center is used for large ensemble performances, including the annual Christmas Festival.\n"},{"word":"SOC","definition":"The Student Organization Committee is the branch of SGA that registers clubs, making them official Orgs. Orgs can apply to SOC for funding for events, speakers, equipment, etc, and also use the SORC poster room to create publicity for their organizations.\n"},{"word":"Specialty Shake","definition":"Throughout the year the Pause Kitchen comes up with new “specialty shakes” that usually pertain to the month or season. For example, in the fall the pumpkin pie shake is a big hit, and in the spring, the shamrock shake is a big seller. In addition to the specialty shakes, the Pause has quite a few regular flavors and toppings to choose from. All are delicious!\n"},{"word":"Spring Concert","definition":"Just like the fall concert, this event is planned and hosted by MEC and is the big hit of the spring!\n"},{"word":"St. Olaf Extra","definition":"Of the many email alias’ on the Hill, the stolaf-extra alias has to be the most active! This list can be used for announcing issues not directly related to St. Olaf such as items for sale, houses for rent, wanted-to-buy announcements, non-profit Northfield events, etc. Any student, faculty, or staff member can subscribe to the list!\n"},{"word":"STOGROW","definition":"The Saint Olaf Garden Research and Organic Works (STOGROW) farm project is a student-run community initiative. STOGROW’s goals are to practice sustainable farming methods; to provide fresh, local vegetables, fruits, herbs, and flowers to our community; to foster agricultural awareness; and to provide education about sustainable food production.\n"},{"word":"Student Activities","definition":"Home to the Student Government Association (SGA), the Office of Student Activities is always upbeat and full of energy! In addition to housing SGA, the office is responsible for helping over 190 student organizations, providing information about student transportation, ticket sales and much more!\n"},{"word":"Study Abroad","definition":"We are known for plentiful and diverse study abroad programs. Each year, more than 800 students study off-campus! Academic programs take place in Europe, Asia, the Middle East, Africa, North, South and Central America and the Pacific. Some programs extend the scope of particular majors, language concentrations or area studies; all add a cross-cultural dimension to a liberal arts education\n"},{"word":"Swing Club","definition":"An organization for any and all students to learn and have fun swing dancing! The club offers lessons each week as well as open social dance time. Guest instructors and trips to the cities are also regular special events. Any style of swing dance is welcome–lindy hop, balboa, shag, blues, etc! Come by anytime, no partner necessary!\n"},{"word":"Swiped Events","definition":"Every ESAC class (Wellness Center/physical education class) requires that students go to informational sessions run by the Wellness Center on a variety of topics. The Wellness Center representatives will “swipe” the Ole Cards of the students to prove they attended the session, or collect your name on a sheet of paper at the end of the event.\n"},{"word":"Taiko","definition":"The student-led, Taiko Group was formed in 2004. Taiko is a form of drumming that originated in Japan. It developed from the martial arts and is a unique rhythmic experience that requires physical and mental agility.\n"},{"word":"Tomson","definition":"Tomson Hall houses the Education Department and the college’s six language departments, plus the World Languages Center. Other building occupants include offices that serve students, such as Admissions and Financial Aid, the Office of International and Off-Campus Studies, the Dean of Students and Residence Life, the Health Center, Office of the Registrar, and Academic Advising, and the Piper Center that helps St. Olaf students discern their vocations and plan careers. The President’s and Provost’s offices and the Office of the Treasurer/Business Office are also located in Tomson Hall.\n"},{"word":"Ultimate","definition":"St. Olaf has 4 Ultimate teams, both Men’s and Women’s. The top teams compete regularly at the national level, while the developmental teams are a great opportunity to learn the game and make awesome friends. These teams are open to any interested Ole, and travel around the country to participate in tournaments.\n"},{"word":"Um! Yah! Yah!","definition":"The school saying and song! Every Ole memorizes this once hitting the Hill:\n\nWe come from St. Olaf, we sure are the real stuff.\nOur team is the cream of the colleges great.\nWe fight fast and furious, our team is injurious.\nTonight Carleton College will sure meet its fate.\n\nUm! Yah! Yah!, Um! Yah! Yah!\nUm! Yah! Yah!, Um! Yah! Yah!\nUm! Yah! Yah!, Um! Yah! Yah!\nUm! Yah! Yah! Yah!\n\nUm! Yah! Yah!, Um! Yah! Yah!\nUm! Yah! Yah!, Um! Yah! Yah!\nUm! Yah! Yah!, Um! Yah! Yah!\nUm! Yah! Yah! Yah!\n"},{"word":"Urness","definition":"Opera and musical theater productions are staged in this hall in the Christiansen Hall of Music.\n"},{"word":"Valhalla","definition":"This student conducted and operated band (pronounced Val·halla) is founded on the principles of making music, meeting other students, and having fun. Each year, Valhalla will open its doors to any student who wants to be part of a band–regardless of membership in other musical groups on campus or musical abilities. The band performs in two concerts per year and also commissions a student composer once a year.\n"},{"word":"Van-GO!","definition":"This transportation service allows students to reserve rides for: community service sites, off-campus student-work assignments, student teaching, classes at Carleton, and medical/dental/therapy appointments in town. Van- GO! operates Monday - Friday, 7am - 6pm. Students must make their reservations online, a day prior to needing a ride.\n"},{"word":"Vegan cookies","definition":"During the school week, The Cage sells cookies made with bananas, oats, and chocolate chips. These cookies go fast, so students rush to The Cage after classes to make sure they can get one\n"},{"word":"Viking Chorus","definition":"The men’s first-year chorus is made up of 85+ member, 60% of which are not music majors. This chorus performs at Homecoming and Family weekend, Christmas Festival, and more!\n"},{"word":"Viking Theater","definition":"The college’s very own movie theater-style room is located in on the first floor of Buntrock. The space is perfect for movie showings, big meetings, and presentations.\n"},{"word":"Volunteer Network","definition":"The Volunteer Network (VN) is committed to providing volunteer opportunities for students that benefit both St. Olaf and the larger community. As a branch of the Student Government Association (SGA) the goal of VN is to make a variety of volunteer programs available to students; some will be one-time events and others will provide for lasting participation. VN provides a wide range of services for children, the elderly, individuals with special needs, pets, and more.\n"},{"word":"Week One","definition":"This is the week in which first-year students get acquainted with campus before all the upper-class students arrive back.\n"},{"word":"Wellness Center","definition":"Serves as a resource to promote awareness and education on issues relating to healthy lifestyles. We provide prevention and intervention services for alcohol and other drug use and abuse concerns. Student Peer Educators (PE) who staff The Wellness Center, located in Buntrock Commons, are available to talk with students one-on-one during office hours. Students are encouraged to come in and talk with a PE on any health related issue.\n"},{"word":"Wind Chime Memorial","definition":"In the middle of the Quad, stands a beautiful wind chime. Built by members of the St. Olaf community over the summer of 2003, this Scandinavian-style wooden tower commemorates the lives of students who have died while enrolled at St. Olaf. The chimes, tuned to the key of D (the key of Beautiful Savior), are engraved with the names of those students. On windy days, the sound of the chimes can be heard almost everywhere on campus.\n"},{"word":"Work-study","definition":"It is very common for students to have an on-campus (or off-campus — CBWS) “student work” job. These jobs are also known as work-study positions. Students are awarded a certain amount of “work-study” allowance from the financial aid office. Work-study jobs can be found all over campus, from the caf to the library to most offices.\n"},{"word":"Ytterboe","definition":"Ytterboe (pronounced Itt·er·boe) Hall houses 402 students in suites of four to ten residents. Each suite (or pod) consists of single and double rooms arranged around a common living area. This hall features a beautiful main lounge, study lounges, computer facilities, sinks in the rooms, and music practice rooms.\n"},{"word":"Zero Week","definition":"One week before first-years arrive, faculty and staff get back into the swing of things. Lots to do for the upcoming school year!\n"},{"word":"Zoom Yah! Yah!","definition":"Runners from across the country (13 states and Spain) have competed in this unique, indoor, full marathon on the Tostrud Center track. Members of the women’s cross country and track and field teams host the event as a fundraiser for their teams.\n"}]}
