{"text":"# All About Olaf Privacy Policy\n\nWe respect your right to privacy when using our app, All About Olaf.\n\nOur policy towards privacy is simple: we aim to collect no data other than what\nwe need to keep the app functional and ensure a smooth experience for all users.\n\n## Who runs this app?\n\nThis app is developed and maintained by a mixed team of current students at St.\nOlaf College and alumni of St. Olaf College.  Anyone is welcome to make\ncontributions to the app, and the source code for the app is publicly available\n[on GitHub][repo].  All contributions go through code review by maintainers.\n\nThis app is entirely self-funded, and we do not include advertisements on our\napp.  As such, our privacy policy is quite simple.\n\n[repo]: https://github.com/StoDevX/AAO-React-Native\n\n## What data do you collect?\n\nWhen you \"Sign in with St. Olaf\" in the settings, your St. Olaf username and\npassword are stored locally, on your device, in the encrypted keychain storage\nmechanism available on your device.  _We do not transmit these credentials to or\nthrough any servers that we control, and we do not have the ability to remotely\naccess these credentials_.  These credentials become inaccessible when you delete\nthe app.  We only transmit these credentials to on-campus servers, and the\nsecurity of those servers is not controlled by us.\n\nWhen you fetch any data besides your personal information, your requests may\nreach servers that we control.  Whenever your app makes such a request, the\nfollowing information is logged:\n\n1. _Your public IP address_.  We do not use this to identify you or for tracking\n  purposes, and this is logged only for diagnostic purposes.\n2. _The version of All About Olaf you are using and information about your\n  phone_, which is sent as part of your device's request.  This data is\n  intentionally vague so that we can also not use this to identify you.\n3. _What you requested and how long it took_, which is widely considered to be\n  fully anonymous.\n\nWe also use _Sentry_, which collects crash reports and cannot be disabled\ncurrently. Sentry collects in-depth information about the device and\ncircumstances leading up to a given crash.\n\nIf you send us suggestions for updates to building hours, we will anonymously add\nthem to the app if we determine that they are correct.  We do not currently give\ncredit for these contributions, primarily because we don't have an easy way of\nattributing these.  In its current form, the \"suggest an update\" feature requires\nyou to send an email, and this email is sent to our developer mailing list.\n\nIf you choose to use the \"Submit a Wi-Fi problem\" feature or other features and\ntools that use college systems such as StoPrint, your data is transmitted to\nthose systems exclusively, and we do not have the ability to see it.\n\nMost importantly: **the developers and maintainers of All About Olaf _will not_,\nunder any circumstances, grant access to any personally identifiable information\nthat we may have collected to a third party, unless as required by law**.  We\ntreat your data as confidential and have the utmost respect for your privacy, and\nwe think that sharing data with other companies for marketing purposes or\ncompensation is a blatant violation of trust; we will never share this data.\n\n### Contact Us\n\nIf you have any questions, comments, or concerns about this privacy policy,\nplease reach out to us via email at <allaboutolaf@frogpond.tech>.  This\nmailing list contains all active maintainers and developers.\n"}
