{
  "text": "<p>Oleville.com and All About Olaf Privacy Policy</p>\n<p>This privacy policy has been compiled to better serve those who are concerned\nwith how their &#39;Personally Identifiable Information&#39; (PII) is being used\nonline. PII, as described in US privacy law and information security, is\ninformation that can be used on its own or with other information to identify,\ncontact, or locate a single person, or to identify an individual in context.\nPlease read our privacy policy carefully to get a clear understanding of how\nwe collect, use, protect or otherwise handle your Personally Identifiable\nInformation in accordance with our website.</p>\n<blockquote>\n<p>What personal information do we collect from the people that visit our blog,\nwebsite or app? When do we collect information?</p>\n</blockquote>\n<p>We collect information from you when you register on our site or enter\ninformation on our site. Provide us with feedback on our products or services</p>\n<blockquote>\n<p>How do we use your information?</p>\n</blockquote>\n<p>We may use the information we collect from you when you register, make a\npurchase, sign up for our newsletter, respond to a survey or marketing\ncommunication, surf the website, or use certain other site features in the\nfollowing ways:</p>\n<p>• To improve our website in order to better serve you.</p>\n<blockquote>\n<p>How do we protect your information?</p>\n</blockquote>\n<p>Our website is scanned on a regular basis for security holes and known\nvulnerabilities in order to make your visit to our site as safe as possible.\nWe use regular Malware Scanning. Your personal information is contained behind\nsecured networks and is only accessible by a limited number of persons who\nhave special access rights to such systems, and are required to keep the\ninformation confidential. In addition, all sensitive/credit information you\nsupply is encrypted via Secure Socket Layer (SSL) technology. We implement a\nvariety of security measures when a user places an order enters, submits, or\naccesses their information to maintain the safety of your personal\ninformation. All transactions are processed through a gateway provider and are\nnot stored or processed on our servers.</p>\n<blockquote>\n<p>Do we use &#39;cookies&#39;?</p>\n</blockquote>\n<p>We do not use cookies for tracking purposes.</p>\n<p>You can choose to have your computer warn you each time a cookie is being\nsent, or you can choose to turn off all cookies. You do this through your\nbrowser settings. Since browser is a little different, look at your browser&#39;s\nHelp Menu to learn the correct way to modify your cookies.</p>\n<p>If you turn cookies off, some features will be disabled. that make your site\nexperience more efficient and may not function properly.</p>\n<blockquote>\n<p>Third-party disclosure</p>\n</blockquote>\n<p>We do not sell, trade, or otherwise transfer to outside parties your\nPersonally Identifiable Information.</p>\n<blockquote>\n<p>Third-party links</p>\n</blockquote>\n<p>Occasionally, at our discretion, we may include or offer third-party products\nor services on our website. These third-party sites have separate and\nindependent privacy policies. We therefore have no responsibility or liability\nfor the content and activities of these linked sites. Nonetheless, we seek to\nprotect the integrity of our site and welcome any feedback about these sites.</p>\n<blockquote>\n<p>California Online Privacy Protection Act</p>\n</blockquote>\n<p>CalOPPA is the first state law in the nation to require commercial websites\nand online services to post a privacy policy. The law&#39;s reach stretches well\nbeyond California to require any person or company in the United States (and\nconceivably the world) that operates websites collecting Personally\nIdentifiable Information from California consumers to post a conspicuous\nprivacy policy on its website stating exactly the information being collected\nand those individuals or companies with whom it is being shared. - See more\nat: <a href=\"http://consumercal.org/california-online-privacy-protection-act-\">http://consumercal.org/california-online-privacy-protection-act-</a>\ncaloppa/#sthash.0FdRbT51.dpuf According to CalOPPA, we agree to the following:</p>\n<p>Users can visit our site anonymously. Once this privacy policy is created, we\nwill add a link to it on our home page or as a minimum, on the first\nsignificant page after entering our website. Our Privacy Policy link includes\nthe word &#39;Privacy&#39; and can be easily be found on the page specified above.</p>\n<p>You will be notified of any Privacy Policy changes:</p>\n<p>• On our Privacy Policy Page</p>\n<p>COPPA (Children Online Privacy Protection Act)</p>\n<p>When it comes to the collection of personal information from children under\nthe age of 13 years old, the Children&#39;s Online Privacy Protection Act (COPPA)\nputs parents in control. The Federal Trade Commission, United States&#39; consumer\nprotection agency, enforces the COPPA Rule, which spells out what operators of\nwebsites and online services must do to protect children&#39;s privacy and safety\nonline.</p>\n<p>We do not specifically market to children under the age of 13 years old.</p>\n<p>Fair Information Practices</p>\n<p>The Fair Information Practices Principles form the backbone of privacy law in\nthe United States and the concepts they include have played a significant role\nin the development of data protection laws around the globe. Understanding the\nFair Information Practice Principles and how they should be implemented is\ncritical to comply with the various privacy laws that protect personal\ninformation.</p>\n<p>In order to be in line with Fair Information Practices we will take the\nfollowing responsive action, should a data breach occur:</p>\n<p>We will notify you via email</p>\n<p>• Within 1 business day</p>\n<p>We will notify the users via in-site notification</p>\n<p>• Within 1 business day</p>\n<p>We also agree to the Individual Redress Principle which requires that\nindividuals have the right to legally pursue enforceable rights against data\ncollectors and processors who fail to adhere to the law. This principle\nrequires not only that individuals have enforceable rights against data users,\nbut also that individuals have recourse to courts or government agencies to\ninvestigate and/or prosecute non-compliance by data processors.</p>\n<p>CAN SPAM Act</p>\n<p>The CAN-SPAM Act is a law that sets the rules for commercial email,\nestablishes requirements for commercial messages, gives recipients the right\nto have emails stopped from being sent to them, and spells out tough penalties\nfor violations.</p>\n<p>To be in accordance with CANSPAM, we agree to the following:</p>\n<p>• Not use false or misleading subjects or email addresses.</p>\n<p>• Identify the message as an advertisement in some reasonable way.</p>\n<p>• Include the physical address of our business or site headquarters.</p>\n<p>• Monitor third-party email marketing services for compliance, if one is used.</p>\n<p>• Honor opt-out/unsubscribe requests quickly.</p>\n<p>• Allow users to unsubscribe by using the link at the bottom of each email.</p>\n<p>If at any time you would like to unsubscribe from receiving future emails, you\ncan email us at sgawebmaster@stolaf.edu and we will promptly remove you from\nALL correspondence.</p>\n<p>Contacting Us</p>\n<p>If there are any questions regarding this privacy policy, you may contact us\nusing the information below.</p>\n<p>oleville.com\n1520 St. Olaf Ave.\nNorthfield, MN 55057\nUSA\nsgawebmaster@stolaf.edu</p>\n<p>Last Edited on 2017-01-01</p>\n"
}